In [1]:
import pandas as pd

In [34]:
export = pd.read_csv('../Data/export.csv')

In [35]:
export.head()

  country  year  volume
0  France  1999   523.1
1  France  2000   584.3
2  France  2001   630.1
3  France  2002   736.7
4  France  2003   845.4

In [36]:
max_year = max(export['year'].tolist())

In [37]:
max_year

2017

In [38]:
export2017 = export[(export['year']==max_year) & (export['country']!='Rest of world')]
export2017

            country  year  volume
18           France  2017  2063.1
37   United Kingdom  2017  1717.2
56           Mexico  2017  1298.0
75          Ireland  2017   618.2
94           Canada  2017   365.3
113          Sweden  2017   259.4
132     Netherlands  2017   258.2
151           Italy  2017   144.9

In [39]:
cities = ['Bourges', 'Nottingham', 'Mexico City', 'Athlone', 'Winnipeg', 'Orebro', 'Amsterdam', 'Florence']
lat = [47.08, 52.95, 19.43, 53.42, 49.90, 59.28, 52.37, 43.77]
lon = [2.40, 1.16, 99.13, 7.94, 97.14, 15.21, 4.90, 11.26]

In [40]:
export2017['cities'] = cities
export2017['lat'] = lat
export2017['lon'] = lon

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [41]:
export2017.head()

           country  year  volume       cities    lat    lon
18          France  2017  2063.1      Bourges  47.08   2.40
37  United Kingdom  2017  1717.2   Nottingham  52.95   1.16
56          Mexico  2017  1298.0  Mexico City  19.43  99.13
75         Ireland  2017   618.2      Athlone  53.42   7.94
94          Canada  2017   365.3     Winnipeg  49.90  97.14

In [42]:
export2017 = export2017.drop(columns='year')

In [43]:
export2017.to_csv('../Data/export2017.csv', index=False)